src/DataProcessors/onyx_Чаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>onyx_Чаты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/onyx_СессииЧата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>onyx_СессииЧата</Name>
			<Comment>Хранение метаданных сессий чата из Onyx</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.onyx_Агенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнееСообщениеID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.onyx_СтатусДоступаСессии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/onyx_Агенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>onyx_Агенты</Name>
			<Comment>Хранение метаданных AI-агентов из Onyx</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Встроенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Видимый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публичный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВладельца</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПровайдерLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Метки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/onyx_Чаты/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиФормы

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Агент) Тогда
		Результат = ПолучитьСписокАгентовБезАгентаПоУмолчаниюНаСервере();
		
		Если Результат.Успех И Результат.Данные.Количество() = 1 Тогда
			ЭтаФорма.Агент = Результат.Данные[0].Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьСписокАгентов();
	Сообщения = ПолучитьHTMLИсторииЧатаНаСервере(Неопределено);
    УстановитьЗаголовокВыбораАгента();
КонецПроцедуры

&НаКлиенте
Процедура СессияПриИзменении(Элемент)
	
	СинхронизироватьСессиюСТаблицей(Сессия);
	ОбновитьИсториюЧата();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// Обработчики команд формы

&НаКлиенте
Процедура ОбновитьСписокАгентов(Команда = Неопределено)
	
	Результат = ПолучитьСписокАгентовНаСервере();
	
	Если Результат.Успех Тогда
		Если Результат.Данные.Количество() > 0 И Не ЗначениеЗаполнено(ЭтаФорма.Агент) Тогда
			ЭтаФорма.Агент = Результат.Данные[0].Ссылка;
		КонецЕсли;
	Иначе
		СообщитьПользователю(Результат.Сообщение);
	КонецЕсли;

    УстановитьЗаголовокВыбораАгента();
	ОбновитьЧатыНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСессию(Команда)
	
	МестныйАгент = ЭтаФорма.Агент;
	
	Если Не ЗначениеЗаполнено(МестныйАгент) Тогда
		СообщитьПользователю(НСтр("ru='Выберите агента перед созданием сессии.'"));
		Возврат;
	КонецЕсли;
	
	Результат = СоздатьСессиюНаСервере(МестныйАгент);
	
	Если Результат.Успех Тогда
		Сессия = Результат.Сессия;
        ЭтаФорма.Сессия = Сессия;
		СинхронизироватьСессиюСТаблицей(Сессия);
        УстановитьЗаголовокВыбораАгента();
	Иначе
		СообщитьПользователю(Результат.Сообщение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	
	Элементы.ОтправитьСообщение.Доступность = Ложь;
	Элементы.Сообщение.Доступность 			= Ложь;
	
	Если ПустаяСтрока(Сообщение) Тогда
		СообщитьПользователю(НСтр("ru='Введите текст сообщения.'"));
		Элементы.ОтправитьСообщение.Доступность = Истина;
		Элементы.Сообщение.Доступность 			= Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сессия) Тогда
		Если ЗначениеЗаполнено(Агент) Тогда
			РезультатСоздания = СоздатьСессиюНаСервере(Агент, Сообщение);
			Если РезультатСоздания.Успех Тогда
				Сессия = РезультатСоздания.Сессия;
				ЭтаФорма.Сессия = Сессия;
				// Устанавливаем наименование из сообщения и дату на сервере
				ТекущаяДата = УстановитьНаименованиеИДатуДляНовойСессии(Сессия, Агент, Сообщение);
				СинхронизироватьСессиюСТаблицей(Сессия, ТекущаяДата);
				ОбновитьЧатыНаФорме();
				ОбновитьИсториюЧата();
			Иначе
				СообщитьПользователю(РезультатСоздания.Сообщение);
				Элементы.ОтправитьСообщение.Доступность = Истина;
				Элементы.Сообщение.Доступность 			= Истина;
				Возврат;
			КонецЕсли;
		Иначе
			СообщитьПользователю(НСтр("ru='Выберите агента перед отправкой сообщения.'"));
			Элементы.ОтправитьСообщение.Доступность = Истина;
			Элементы.Сообщение.Доступность 			= Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаЧата = ПолучитьИлиСоздатьСтрокуЧата(Сессия);
	Если СтрокаЧата = Неопределено Тогда
		СообщитьПользователю(НСтр("ru='Не удалось подготовить строку чата для отправки сообщения.'"));
		Элементы.ОтправитьСообщение.Доступность = Истина;
		Элементы.Сообщение.Доступность 			= Истина;
		Возврат;
	КонецЕсли;
	
	СброситьПараметрыЗаданияДляЧата(СтрокаЧата);
	СтрокаЧата.АдресЗадания = ПоместитьВоВременноеХранилище(Неопределено);
	СтрокаЧата.ПоследнийОтправленныйТекст = Сообщение;
	
	Результат = ОтправитьСообщениеНаСервереВФоне(Сессия, СтрокаЧата.ПоследнийОтправленныйТекст, СтрокаЧата.АдресЗадания);
	
	Если Результат.Успех Тогда
		Сообщение = "";
		СтрокаЧата.ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		ПоказатьИндикаторПечатиДляЧата(СтрокаЧата);
		ПодключитьОбработчикОжидания("ПроверитьРезультФоновогоЗаданияОтправкаСообщенияНаКлиенте", 1, Истина);
	Иначе
		СообщитьПользователю(Результат.Сообщение);
		СброситьПараметрыЗаданияДляЧата(СтрокаЧата);
		Элементы.ОтправитьСообщение.Доступность = Истина;
		Элементы.Сообщение.Доступность 			= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРезультФоновогоЗаданияОтправкаСообщенияНаКлиенте() Экспорт 
	
	ЕстьВыполняющиеся = Ложь;
	
	Для Каждого СтрокаЧата Из Чаты Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаЧата.ИдентификаторЗадания) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат = ПолучитьРезультФоновогоЗаданияОтправкаСообщенияНаСервереБезКонтекста(СтрокаЧата.ИдентификаторЗадания);
		
		Если Результат.Выполняется Тогда
			ЕстьВыполняющиеся = Истина;
			ПоказатьИндикаторПечатиДляЧата(СтрокаЧата);
			Продолжить;
		КонецЕсли;
		
		Если Результат.Успех Тогда
			ОбработатьУспехФоновогоЗадания(СтрокаЧата);
		Иначе
			ОбработатьНеудачуФоновогоЗадания(СтрокаЧата);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьВыполняющиеся Тогда
		ПодключитьОбработчикОжидания("ПроверитьРезультФоновогоЗаданияОтправкаСообщенияНаКлиенте", 1, Истина);
		Элементы.ОтправитьСообщение.Доступность = Ложь;
		Элементы.Сообщение.Доступность 			= Ложь;
	Иначе
		Элементы.ОтправитьСообщение.Доступность = Истина;
		Элементы.Сообщение.Доступность 			= Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииФормы

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции формы

&НаСервереБезКонтекста
Функция ПолучитьРезультФоновогоЗаданияОтправкаСообщенияНаСервереБезКонтекста(ИдентификаторЗадания)

	Возврат НайтиФоновоеЗадание(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура СообщитьПользователю(ТекстСообщения)
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	Сообщить(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЧатыНаФорме()
	
	ОбновитьЧатыНаСервере(Агент);
	СинхронизироватьСессиюСТаблицей(Сессия);
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьСессиюСТаблицей(Знач СсылкаСессии, Дата = '00010101')
	
	Если Не ЗначениеЗаполнено(СсылкаСессии) Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьИлиСоздатьСтрокуЧата(СсылкаСессии, Дата);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуЧатаПоНомеру(НомерСтроки)
	
	Если Чаты = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(НомерСтроки) <> Тип("Число") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НомерСтроки < 0 ИЛИ НомерСтроки >= Чаты.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Чаты[НомерСтроки];
	
КонецФункции

&НаКлиенте
Процедура ЧатыHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ДанныеСобытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаВыбора = ПолучитьHrefИзДанныхHTMLСобытия(ДанныеСобытия);
	
	Если ПустаяСтрока(СсылкаВыбора) Тогда
		Возврат;
	КонецЕсли;
	
	Префикс = "chat://select/";
	Если Не СтрНачинаетсяС(СсылкаВыбора, Префикс) Тогда
		Возврат;
	КонецЕсли;
	
	СтроковыйНомер = Сред(СсылкаВыбора, СтрДлина(Префикс) + 1);
	НомерСтроки = -1;
	Попытка
		НомерСтроки = Число(СтроковыйНомер);
	Исключение
		НомерСтроки = -1;
	КонецПопытки;
	
	СтрокаЧата = ПолучитьСтрокуЧатаПоНомеру(НомерСтроки);
	Если СтрокаЧата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаЧата.Чат) Тогда
		
		ЭтаФорма.Сессия = СтрокаЧата.Чат;
		
		ОбновитьИсториюЧата();
		ЧатыHTML = ПолучитьHTMLЧатовНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьHrefИзДанныхHTMLСобытия(Знач ДанныеСобытия)
	
	Если ДанныеСобытия = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Если ДанныеСобытия.Свойство("Href") Тогда
		Возврат ЗначениеСтрокойБезНеопределено(ДанныеСобытия.Href);
	КонецЕсли;
	
	// Для совместимости пытаемся извлечь ссылку напрямую из элементов Anchor или Element.
	Если ДанныеСобытия.Свойство("Anchor") Тогда
		Ссылка = ПолучитьHrefИзHTMLОбъекта(ДанныеСобытия.Anchor);
		Если Не ПустаяСтрока(Ссылка) Тогда
			Возврат Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеСобытия.Свойство("Element") Тогда
		Ссылка = ПолучитьHrefИзHTMLОбъекта(ДанныеСобытия.Element);
		Если Не ПустаяСтрока(Ссылка) Тогда
			Возврат Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Функция ПолучитьHrefИзHTMLОбъекта(Знач HTMLОбъект)
	
	Если HTMLОбъект = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Попытка
		ЗначениеHref = HTMLОбъект.href;
		Если ЗначениеHref <> Неопределено Тогда
			Возврат Строка(ЗначениеHref);
		КонецЕсли;
	Исключение
		// Игнорируем ошибки доступа к свойству href COM-объекта.
		// Это нормальная ситуация, если объект не поддерживает данное свойство.
		// Логирование недоступно в клиентском коде, ошибка не критична.
		// Ошибка намеренно игнорируется.
		ИгнорируемОшибку = Истина;
	КонецПопытки;
	
	Попытка
		Если HTMLОбъект.getAttribute <> Неопределено Тогда
			ЗначениеHref = HTMLОбъект.getAttribute("href");
			Если ЗначениеHref <> Неопределено Тогда
				Возврат Строка(ЗначениеHref);
			КонецЕсли;
		КонецЕсли;
	Исключение
		// Игнорируем ошибки доступа к методу getAttribute COM-объекта.
		// Это нормальная ситуация, если объект не поддерживает данный метод.
		// Логирование недоступно в клиентском коде, ошибка не критична.
		// Ошибка намеренно игнорируется.
		ИгнорируемОшибку = Истина;
	КонецПопытки;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Функция ЗначениеСтрокойБезНеопределено(Знач Значение)
	
	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат Значение;
	КонецЕсли;
	
	Возврат Строка(Значение);
	
КонецФункции

&НаСервере
Функция ПолучитьМетаданныеСессииДляОтображенияНаСервере(Знач СсылкаСессии)
	
	Если Не ЗначениеЗаполнено(СсылкаСессии) Тогда
		Результат = Новый Структура("Наименование,Описание,Пользователь,ДатаПоследнегоСообщения,ДатаСоздания,Активна,ДатаСинхронизации",
			"", "", "", Неопределено, Неопределено, Ложь, Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	Возврат Справочники.onyx_СессииЧата.ПолучитьМетаданные(СсылкаСессии);
	
КонецФункции

&НаСервереБезКонтекста
Функция УсечьТекст(Знач Текст, Знач МаксДлина)
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат "";
	КонецЕсли;
	
	Если МаксДлина <= 0 Тогда
		Возврат Текст;
	КонецЕсли;
	
	Если СтрДлина(Текст) <= МаксДлина Тогда
		Возврат Текст;
	КонецЕсли;
	
	Возврат Лев(Текст, МаксДлина - 1) + "…";
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеИстина(Знач Значение)
	
	Если ТипЗнч(Значение) = Тип("Булево") Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Значение <> 0;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Нормализованное = ВРег(СокрЛП(Значение));
		Возврат Нормализованное = "TRUE" ИЛИ Нормализованное = "ИСТИНА" ИЛИ Нормализованное = "1";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Значение) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция НайтиСтрокуЧата(Знач СсылкаСессии)
	
	Если Не ЗначениеЗаполнено(СсылкаСессии) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого СтрокаЧата Из Чаты Цикл
		Если СтрокаЧата.Чат = СсылкаСессии Тогда
			Возврат СтрокаЧата;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИлиСоздатьСтрокуЧата(Знач СсылкаСессии, Дата = '00010101')
	
	СтрокаЧата = НайтиСтрокуЧата(СсылкаСессии);
	
	Если СтрокаЧата <> Неопределено Тогда
		Возврат СтрокаЧата;
	КонецЕсли;
	
	СтрокаЧата = Чаты.Добавить();
	СтрокаЧата.Чат = СсылкаСессии;
	СтрокаЧата.АдресЗадания = "";
	СтрокаЧата.ИдентификаторЗадания = Неопределено;
	СтрокаЧата.ПоказанИндикаторПечати = Ложь;
	СтрокаЧата.ПоследнийОтправленныйТекст = "";
	
	Если ЗначениеЗаполнено(Дата) Тогда 
		СтрокаЧата.ДатаПоследнегоСообщения = Дата;
	КонецЕсли;
	
	Возврат СтрокаЧата;
	
КонецФункции

&НаКлиенте
Процедура СброситьПараметрыЗаданияДляЧата(СтрокаЧата)
	
	Если СтрокаЧата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаЧата.ИдентификаторЗадания 		= Неопределено;
	СтрокаЧата.АдресЗадания 				= "";
	СтрокаЧата.ПоказанИндикаторПечати 		= Ложь;
	СтрокаЧата.ПоследнийОтправленныйТекст 	= "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИндикаторПечатиДляЧата(СтрокаЧата)
	
	Если СтрокаЧата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаЧата.ПоказанИндикаторПечати Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаЧата.Чат) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяАгента = "";
	Если ЗначениеЗаполнено(Агент) Тогда
		ИмяАгента = Строка(Агент);
	КонецЕсли;
	
	HTMLЧатаСИндикатором = ПолучитьHTMLЧатаСИндикаторомНаСервере(СтрокаЧата.Чат, ИмяАгента, СтрокаЧата.ПоследнийОтправленныйТекст);
	Если ЗначениеЗаполнено(HTMLЧатаСИндикатором) Тогда
		ЭтаФорма.Сообщения = HTMLЧатаСИндикатором;
		СтрокаЧата.ПоказанИндикаторПечати = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьУспехФоновогоЗадания(СтрокаЧата)
	
	Если СтрокаЧата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗадания = Неопределено;
	
	Если ЗначениеЗаполнено(СтрокаЧата.АдресЗадания) Тогда
		Попытка
			ДанныеЗадания = ПолучитьИзВременногоХранилища(СтрокаЧата.АдресЗадания);
		Исключение
			ДанныеЗадания = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	СброситьПараметрыЗаданияДляЧата(СтрокаЧата);
	
	Если ДанныеЗадания <> Неопределено Тогда 
		Если ЗначениеЗаполнено(СтрокаЧата.Чат)
			И Сессия = СтрокаЧата.Чат Тогда
			ОбновитьИсториюЧата();
			ОбновитьНаименованиеСессии(СтрокаЧата.Чат);
			ЧатыHTML = ПолучитьHTMLЧатовНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНеудачуФоновогоЗадания(СтрокаЧата)
	
	СброситьПараметрыЗаданияДляЧата(СтрокаЧата);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЧатыНаСервере(Знач Агент)
	
	Чаты.Очистить();
	
	Сессии = onyx_РаботаССессиямиЧата.НайтиСессииЧата(Агент);
	
	ТаблицаСортировки = Новый ТаблицаЗначений;
	ТаблицаСортировки.Колонки.Добавить("Чат");
	ТаблицаСортировки.Колонки.Добавить("ДатаПоследнегоСообщения");
	
	Для Каждого СсылкаСессии Из Сессии Цикл
		МетаданныеСессии = ПолучитьМетаданныеСессииДляОтображенияНаСервере(СсылкаСессии);
		Если МетаданныеСессии = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеИстина(МетаданныеСессии.Активна) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСортировки = ТаблицаСортировки.Добавить();
		СтрокаСортировки.Чат = СсылкаСессии;
		СтрокаСортировки.ДатаПоследнегоСообщения = МетаданныеСессии.ДатаПоследнегоСообщения;
	КонецЦикла;
	
	Если ТаблицаСортировки.Количество() > 0 Тогда
		Попытка
			ТаблицаСортировки.Сортировать("ДатаПоследнегоСообщения Убыв, Чат Возр");
		Исключение
			// Игнорируем ошибки сортировки таблицы значений.
			// Это может произойти при некорректных данных в колонках.
			// Логирование недоступно в клиентском коде, ошибка не критична.
			// Ошибка намеренно игнорируется.
			ИгнорируемОшибку = Истина;
		КонецПопытки;
	КонецЕсли;
	
	Для Каждого СтрокаСортировки Из ТаблицаСортировки Цикл
		НоваяСтрока = Чаты.Добавить();
		НоваяСтрока.Чат = СтрокаСортировки.Чат;
		НоваяСтрока.АдресЗадания = "";
		НоваяСтрока.ИдентификаторЗадания = Неопределено;
		НоваяСтрока.ПоказанИндикаторПечати = Ложь;
		НоваяСтрока.ПоследнийОтправленныйТекст = "";
		Если НоваяСтрока.Свойство("ДатаПоследнегоСообщения") Тогда
			НоваяСтрока.ДатаПоследнегоСообщения = СтрокаСортировки.ДатаПоследнегоСообщения;
		КонецЕсли;
	КонецЦикла;
	
	ЧатыHTML = СформироватьHTMLЧатовНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьHTMLЧатовНаСервере()
	
	Возврат СформироватьHTMLЧатовНаСервере();
	
КонецФункции

&НаСервере
Функция СформироватьHTMLЧатовНаСервере()
	
	Если Чаты = Неопределено ИЛИ Чаты.Количество() = 0 Тогда
		Возврат ПолучитьПустойHTMLЧатовНаСервере();
	КонецЕсли;
	
	Группы = Новый Структура;
	Группы.Вставить("Сегодня", Новый Массив);
	Группы.Вставить("Вчера", Новый Массив);
	Группы.Вставить("Ранее", Новый Массив);
	
	Для Индекс = 0 По Чаты.Количество() - 1 Цикл
		СтрокаЧата = Чаты[Индекс];
		СсылкаСессии = СтрокаЧата.Чат;
		
		ДатаПоследнегоСообщения = Неопределено;
		Если СтрокаЧата.Свойство("ДатаПоследнегоСообщения") Тогда
			ДатаПоследнегоСообщения = СтрокаЧата.ДатаПоследнегоСообщения;
		КонецЕсли;
		
		ДанныеМетаданных = ПолучитьМетаданныеСессииДляОтображенияНаСервере(СсылкаСессии);
		
		Категория = ОпределитьКатегориюГруппыЧата(ДатаПоследнегоСообщения);
		
		ЗаписьГруппы = Новый Структура;
		ЗаписьГруппы.Вставить("СтрокаЧата", СтрокаЧата);
		ЗаписьГруппы.Вставить("СсылкаСессии", СсылкаСессии);
		ЗаписьГруппы.Вставить("ДатаПоследнегоСообщения", ДатаПоследнегоСообщения);
		ЗаписьГруппы.Вставить("ДанныеМетаданных", ДанныеМетаданных);
		ЗаписьГруппы.Вставить("Номер", Индекс);
		
		Группы[Категория].Добавить(ЗаписьГруппы);
	КонецЦикла;
	
	Док = Новый ТекстовыйДокумент;
	Док.ДобавитьСтроку("<!DOCTYPE html>");
	Док.ДобавитьСтроку("<html><head><meta charset=""UTF-8"">");
	Док.ДобавитьСтроку("<style>");
	Док.ДобавитьСтроку("body { margin:0; padding:12px; font-family:'Segoe UI',sans-serif; background:#f4f6fb; }");
	Док.ДобавитьСтроку(".chat-list { display:flex; flex-direction:column; }");
	Док.ДобавитьСтроку(".chat-group { margin-bottom:20px; }");
	Док.ДобавитьСтроку(".chat-group-title { font-size:11px; font-weight:600; text-transform:uppercase; letter-spacing:0.05em; color:#94a3b8; margin:8px 0 6px; }");
	Док.ДобавитьСтроку(".chat-card { display:block; padding:12px 14px; border-radius:10px; text-decoration:none; border:1px solid transparent; background:#fff; box-shadow:0 1px 3px rgba(15,23,42,0.08); transition:all 0.15s ease; color:#0f172a; font-size:13px; margin-bottom:8px; }");
	Док.ДобавитьСтроку(".chat-card:hover { transform:translateY(-1px); box-shadow:0 5px 12px rgba(15,23,42,0.12); }");
	Док.ДобавитьСтроку(".chat-card.active { border-color:#2563eb; box-shadow:0 0 0 2px rgba(37,99,235,0.15); }");
	Док.ДобавитьСтроку(".chat-head { display:flex; justify-content:space-between; align-items:center; gap:8px; }");
	Док.ДобавитьСтроку(".chat-title { font-weight:600; font-size:13px; color:#111827; }");
	Док.ДобавитьСтроку(".chat-date { font-size:11px; color:#94a3b8; white-space:nowrap; }");
	Док.ДобавитьСтроку("</style></head><body>");
	Док.ДобавитьСтроку("<div class=""chat-list"">");
	
	МассивГрупп = Новый Массив;
	МассивГрупп.Добавить("Сегодня");
	МассивГрупп.Добавить("Вчера");
	МассивГрупп.Добавить("Ранее");
	
	Для Каждого ИмяГруппы Из МассивГрупп Цикл
		Коллекция = Группы[ИмяГруппы];
		Если Коллекция.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НазваниеГруппыЧатов = ВывестиНазваниеГруппыЧатов(ИмяГруппы);
		Док.ДобавитьСтроку("<div class=""chat-group"">");
		Док.ДобавитьСтроку(СтрШаблон("<div class=""chat-group-title"">%1</div>", НазваниеГруппыЧатов));
		
		Для Каждого ЗаписьГруппы Из Коллекция Цикл
			СсылкаСессии = ЗаписьГруппы.СсылкаСессии;
			ДатаПоследнегоСообщения = ЗаписьГруппы.ДатаПоследнегоСообщения;
			ДанныеМетаданных = ЗаписьГруппы.ДанныеМетаданных;
			Номер = ЗаписьГруппы.Номер;
			
			Активный = ЗначениеЗаполнено(Сессия) И ЗначениеЗаполнено(СсылкаСессии) И Сессия = СсылкаСессии;
			Название = ЭкранироватьHTML(ВыбратьИмяЧатаДляОтображения(СсылкаСессии, ДанныеМетаданных, Активный));
			
			ДатаСтрокой = ЭкранироватьHTML(ПолучитьСтрокуДатыИзЗначения(ДатаПоследнегоСообщения));
			
			КлассАктивности = ?(Активный, " active", "");
			
			СсылкаВыбора = СтрШаблон("chat://select/%1", Номер);
			
			Док.ДобавитьСтроку(СтрШаблон("<a href=""%1"" class=""chat-card%2"">", СсылкаВыбора, КлассАктивности));
			Док.ДобавитьСтроку("<div class=""chat-head"">");
			Док.ДобавитьСтроку(СтрШаблон("<span class=""chat-title"">%1</span>", Название));
			Док.ДобавитьСтроку(СтрШаблон("<span class=""chat-date"">%1</span>", ДатаСтрокой));
			Док.ДобавитьСтроку("</div>");
			Док.ДобавитьСтроку("</a>");
		КонецЦикла;
		
		Док.ДобавитьСтроку("</div>");
	КонецЦикла;
	
	Док.ДобавитьСтроку("</div></body></html>");
	
	Возврат Док.ПолучитьТекст();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПустойHTMLЧатовНаСервере()
	
	Возврат "<html><head><meta charset=""UTF-8""></head><body style='margin:0;padding:32px;font-family:Segoe UI,sans-serif;color:#94a3b8;text-align:center;background:#f8fafc;'><div style='font-size:14px;'>Нет активных сессий для отображения.</div></body></html>";
	
КонецФункции

&НаСервере
Функция ВыбратьИмяЧатаДляОтображения(СсылкаСессии, ДанныеМетаданных, Активный)
	
	Если ДанныеМетаданных <> Неопределено И Не ПустаяСтрока(ДанныеМетаданных.Наименование) Тогда
		Возврат УсечьТекст(ДанныеМетаданных.Наименование, ?(Активный, 48, 28));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаСессии) Тогда
		Попытка
			Представление = ОчиститьСтрокуОтGUID(Строка(СсылкаСессии.ПолучитьПредставление()));
		Исключение
			Представление = ОчиститьСтрокуОтGUID(Строка(СсылкаСессии.Код));
			Если ПустаяСтрока(Представление) Тогда
				Представление = ОчиститьСтрокуОтGUID(Строка(СсылкаСессии));
			КонецЕсли;
		КонецПопытки;
		Если ПустаяСтрока(Представление) Тогда
			Представление = НСтр("ru='Сессия'");
		КонецЕсли;
		Возврат УсечьТекст(Представление, ?(Активный, 32, 20));
	КонецЕсли;
	
	Возврат НСтр("ru='Неизвестная сессия'");
	
КонецФункции

&НаСервереБезКонтекста
Функция ОчиститьСтрокуОтGUID(Знач Текст)
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат "";
	КонецЕсли;
	
	Результат = Текст;
	
	МассивРазделителей = Новый Массив;
	МассивРазделителей.Добавить("{");
	МассивРазделителей.Добавить("(");
	
	Для Каждого Разделитель Из МассивРазделителей Цикл
		Позиция = СтрНайти(Результат, Разделитель);
		Если Позиция > 0 Тогда
			Результат = СокрП(Лев(Результат, Позиция - 1));
		КонецЕсли;
	КонецЦикла;
	
	КоличествоТире = ПодсчитатьКоличествоПодстрок(ВРег(Результат), "-");
	Если СтрДлина(Результат) >= 36 И КоличествоТире >= 4 Тогда
		Возврат Лев(Результат, 8) + "…" + Прав(Результат, 4);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПодсчитатьКоличествоПодстрок(Знач Текст, Знач Подстрока)
	
	Если ПустаяСтрока(Текст) ИЛИ ПустаяСтрока(Подстрока) Тогда
		Возврат 0;
	КонецЕсли;
	
	Количество = 0;
	Позиция = СтрНайти(Текст, Подстрока);
	Пока Позиция > 0 Цикл
		Количество = Количество + 1;
		Текст = Сред(Текст, Позиция + СтрДлина(Подстрока));
		Позиция = СтрНайти(Текст, Подстрока);
	КонецЦикла;
	
	Возврат Количество;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтрокуДатыИзЗначения(Знач Дата)
	
	Если ЗначениеЗаполнено(Дата) Тогда
		Возврат Формат(Дата, "ДФ='dd.MM HH:mm'");
	КонецЕсли;
	
	Возврат НСтр("ru='Дата не определена'");
	
КонецФункции

&НаСервереБезКонтекста
Функция ОпределитьКатегориюГруппыЧата(ДатаСинхронизации)
	
	Если Не ЗначениеЗаполнено(ДатаСинхронизации) Тогда
		Возврат "Ранее";
	КонецЕсли;
	
	Сейчас = ТекущаяДатаСеанса();
	НачалоСегодня = НачалоДня(Сейчас);
	
	Если ДатаСинхронизации >= НачалоСегодня Тогда
		Возврат "Сегодня";
	КонецЕсли;
	
	НачалоВчера = НачалоСегодня - 24 * 60 * 60;
	Если ДатаСинхронизации >= НачалоВчера Тогда
		Возврат "Вчера";
	КонецЕсли;
	
	Возврат "Ранее";
	
КонецФункции

&НаСервереБезКонтекста
Функция ВывестиНазваниеГруппыЧатов(ИмяГруппы)
	
	Если ИмяГруппы = "Сегодня" Тогда
		Возврат НСтр("ru='Сегодня'");
	ИначеЕсли ИмяГруппы = "Вчера" Тогда
		Возврат НСтр("ru='Вчера'");
	КонецЕсли;
	
	Возврат НСтр("ru='Несколько дней назад'");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокАгентовНаСервере()
	
	МассивАгентов = Новый Массив;
	
	Попытка
		Ссылки = onyx_РаботаСАгентами.ПолучитьСписокАгентов();
		
		Для Каждого СсылкаАгента Из Ссылки Цикл
			Строка = Новый Структура;
			Строка.Вставить("Ссылка", СсылкаАгента);
			Попытка
				Строка.Вставить("Наименование", СсылкаАгента.Наименование);
			Исключение
				Строка.Вставить("Наименование", "");
			КонецПопытки;
			Попытка
				Строка.Вставить("Описание", СсылкаАгента.Описание);
			Исключение
				Строка.Вставить("Описание", "");
			КонецПопытки;
			МассивАгентов.Добавить(Строка);
		КонецЦикла;
		
		Возврат Новый Структура("Успех,Сообщение,Данные", Истина, "", МассивАгентов);
	Исключение
		Возврат Новый Структура("Успех,Сообщение,Данные", Ложь, ОписаниеОшибки(), МассивАгентов);
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыФормыВыбораАгентаНаСервере()
	
	ПараметрыФормы = Новый Структура;
	
	Отбор = Новый Структура;
	Отбор.Вставить("АгентПоУмолчанию", Ложь);
	
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокАгентовБезАгентаПоУмолчаниюНаСервере()
	
	МассивАгентов = Новый Массив;
	
	Попытка
		Ссылки = onyx_РаботаСАгентами.ПолучитьСписокАгентов();
		
		Для Каждого СсылкаАгента Из Ссылки Цикл
			
			АгентПоУмолчанию = Неопределено;
			Попытка
				АгентПоУмолчанию = СсылкаАгента.АгентПоУмолчанию;
			Исключение
				АгентПоУмолчанию = Справочники.onyx_Агенты.ПолучитьАгентПоУмолчанию(СсылкаАгента);
			КонецПопытки;
			
			// Пропускаем агента, если АгентПоУмолчанию = Ложь
			Если ТипЗнч(АгентПоУмолчанию) = Тип("Булево") И АгентПоУмолчанию = Истина Тогда
				Продолжить;
			КонецЕсли;
			
			Строка = Новый Структура;
			Строка.Вставить("Ссылка", СсылкаАгента);
			Попытка
				Строка.Вставить("Наименование", СсылкаАгента.Наименование);
			Исключение
				Строка.Вставить("Наименование", "");
			КонецПопытки;
			Попытка
				Строка.Вставить("Описание", СсылкаАгента.Описание);
			Исключение
				Строка.Вставить("Описание", "");
			КонецПопытки;
			МассивАгентов.Добавить(Строка);
		КонецЦикла;
		
		Возврат Новый Структура("Успех,Сообщение,Данные", Истина, "", МассивАгентов);
	Исключение
		Возврат Новый Структура("Успех,Сообщение,Данные", Ложь, ОписаниеОшибки(), МассивАгентов);
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьСессиюНаСервере(Знач СсылкаАгента, Знач ПредложенноеНаименование = "")
	
	Если Не ЗначениеЗаполнено(СсылкаАгента) Тогда
		Возврат Новый Структура("Успех,Сообщение,Сессия", Ложь, НСтр("ru='Агент не выбран.'"), Неопределено);
	КонецЕсли;
	
	ИдентификаторАгента = ПолучитьИдентификаторАгента(СсылкаАгента);
	Если Не ЗначениеЗаполнено(ИдентификаторАгента) Тогда
		Возврат Новый Структура("Успех,Сообщение,Сессия", Ложь, НСтр("ru='Не найден идентификатор выбранного агента.'"), Неопределено);
	КонецЕсли;
	
	ОписаниеСессии = ПодготовитьОписаниеНовойСессии(СсылкаАгента, ПредложенноеНаименование);
	
	Попытка
		СсылкаСессии = onyx_РаботаССессиямиЧата.СоздатьСессиюЧата(ИдентификаторАгента, ОписаниеСессии);
		ШаблонСообщения = НСтр("ru='Создана сессия %1.'");
		Если ТипЗнч(ШаблонСообщения) <> Тип("Строка") ИЛИ ПустаяСтрока(ШаблонСообщения) Тогда
			ШаблонСообщения = "Создана сессия %1.";
		КонецЕсли;
		
		МетаданныеСессии = Справочники.onyx_СессииЧата.ПолучитьМетаданные(СсылкаСессии);
		ОписаниеСессии = МетаданныеСессии.Наименование;
		Если ПустаяСтрока(ОписаниеСессии) Тогда
			ОписаниеСессии = Строка(СсылкаСессии);
		КонецЕсли;
		
		Сообщение = СтрШаблон(ШаблонСообщения, ОписаниеСессии);
		Возврат Новый Структура("Успех,Сообщение,Сессия", Истина, Сообщение, СсылкаСессии);
	Исключение
		Возврат Новый Структура("Успех,Сообщение,Сессия", Ложь, ОписаниеОшибки(), Неопределено);
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПодготовитьОписаниеНовойСессии(Знач СсылкаАгента, Знач ПредложенноеНаименование)
	
	МаксимальнаяДлина = onyx_РаботаССессиямиЧата.МаксимальнаяДлинаОписанияСессии();
	Наименование = "";
	
	Если ТипЗнч(ПредложенноеНаименование) = Тип("Строка") Тогда
		Наименование = onyx_РаботаССессиямиЧата.ПодготовитьТекстНаименования(ПредложенноеНаименование);
	КонецЕсли;
	
	Если ПустаяСтрока(Наименование) Тогда
		Попытка
			ИмяАгента = Строка(СсылкаАгента.Наименование);
			Наименование = onyx_РаботаССессиямиЧата.ПодготовитьТекстНаименования(ИмяАгента);
		Исключение
			Наименование = "";
		КонецПопытки;
	КонецЕсли;
	
	Если ПустаяСтрока(Наименование) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
		Шаблон = НСтр("ru='Сессия %1'");
		Если ПустаяСтрока(Шаблон) Тогда
			Шаблон = "Сессия %1";
		КонецЕсли;
		Наименование = СтрШаблон(Шаблон, Формат(ДатаСоздания, "ДЛФ=DD.MM.YYYY ЧЧ:ММ"));
	КонецЕсли;
	
	Возврат onyx_РаботаССессиямиЧата.УсечьСтроку(Наименование, МаксимальнаяДлина);
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтправитьСообщениеНаСервере(Знач СсылкаСессии, Знач ТекстСообщения)
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		Возврат Новый Структура("Успех,Сообщение,Ответ", Ложь, НСтр("ru='Сообщение не заполнено.'"), Неопределено);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаСессии) Тогда
		Возврат Новый Структура("Успех,Сообщение,Ответ", Ложь, НСтр("ru='Сессия не выбрана.'"), Неопределено);
	КонецЕсли;
	
	ИдентификаторСессии = ПолучитьИдентификаторСессии(СсылкаСессии);
	Если Не ЗначениеЗаполнено(ИдентификаторСессии) Тогда
		Возврат Новый Структура("Успех,Сообщение,Ответ", Ложь, НСтр("ru='У выбранной сессии отсутствует идентификатор Onyx.'"), Неопределено);
	КонецЕсли;
	
	Попытка
		ОтветOnyx = onyx_РаботаССессиямиЧата.ОтправитьСообщение(ИдентификаторСессии, ТекстСообщения);
		Сообщение = ПолучитьТекстОтветаOnyx(ОтветOnyx);
		Если ПустаяСтрока(Сообщение) Тогда
			Сообщение = НСтр("ru='Сообщение успешно отправлено.'");
		КонецЕсли;
		Возврат Новый Структура("Успех,Сообщение,Ответ", Истина, Сообщение, ОтветOnyx);
	Исключение
		Возврат Новый Структура("Успех,Сообщение,Ответ", Ложь, ОписаниеОшибки(), Неопределено);
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтправитьСообщениеНаСервереВФоне(Знач СсылкаСессии, Знач ТекстСообщения, АдресЗадания)
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		Возврат Новый Структура("Успех,Сообщение,Ответ", Ложь, НСтр("ru='Сообщение не заполнено.'"), Неопределено);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаСессии) Тогда
		Возврат Новый Структура("Успех,Сообщение,Ответ", Ложь, НСтр("ru='Сессия не выбрана.'"), Неопределено);
	КонецЕсли;
	
	ИдентификаторСессии = ПолучитьИдентификаторСессии(СсылкаСессии);
	Если Не ЗначениеЗаполнено(ИдентификаторСессии) Тогда
		Возврат Новый Структура("Успех,Сообщение,Ответ", Ложь, НСтр("ru='У выбранной сессии отсутствует идентификатор Onyx.'"), Неопределено);
	КонецЕсли;
	
	Попытка
		
		УникальныйИдентификатор = Новый УникальныйИдентификатор;
		
		ПараметрыВыполнения = Новый Массив;
		ПараметрыВыполнения.Добавить(ИдентификаторСессии);
		ПараметрыВыполнения.Добавить(ТекстСообщения);
		ПараметрыВыполнения.Добавить(Неопределено);
		ПараметрыВыполнения.Добавить(АдресЗадания);
		
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("onyx_РаботаССессиямиЧата.ОтправитьСообщение",ПараметрыВыполнения, УникальныйИдентификатор);
		
		Возврат Новый Структура("Успех, ИдентификаторЗадания, Сообщение", Истина, ФоновоеЗадание.УникальныйИдентификатор, "");
	Исключение
		Возврат Новый Структура("Успех, ИдентификаторЗадания, Сообщение", Ложь, , ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ПолучитьHTMLИсторииЧатаНаСервере(Знач СсылкаСессии)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	Если ОбъектОбработки = Неопределено Тогда
		Возврат НСтр("ru='<html><head><meta charset=''UTF-8''></head><body style=''margin:0;padding:12px 16px;background:#fff5f5;font-family:Segoe UI,Tahoma,Verdana,sans-serif;color:#d93025;''><div style=''border:1px solid #f5c2c7;background:#fff;box-shadow:0 1px 3px rgba(220,38,38,0.15);padding:14px;border-radius:8px;''><span style=''font-weight:600;display:block;margin-bottom:6px;''>Ошибка загрузки истории:</span><span style=''color:#7f1d1d;''>Объект обработки не инициализирован</span></div></body></html>'");
	КонецЕсли;
	
	Попытка
		Возврат ОбъектОбработки.ПолучитьHTMLИсторииЧата(СсылкаСессии);
	Исключение
		Возврат ОбъектОбработки.СформироватьHTMLОшибки(ОписаниеОшибки());
	КонецПопытки;
	
 КонецФункции

&НаСервере
Функция ПолучитьHTMLЧатаСИндикаторомНаСервере(Знач СсылкаСессии, Знач ИмяАгента, Знач ТекстПользователя = Неопределено)

	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Если ОбъектОбработки = Неопределено Тогда
		Возврат НСтр("ru='<html><head><meta charset=''UTF-8''></head><body style=''margin:0;padding:12px 16px;background:#fff5f5;font-family:Segoe UI,Tahoma,Verdana,sans-serif;color:#d93025;''><div style=''border:1px solid #f5c2c7;background:#fff;box-shadow:0 1px 3px rgba(220,38,38,0.15);padding:14px;border-radius:8px;''><span style=''font-weight:600;display:block;margin-bottom:6px;''>Ошибка:</span><span style=''color:#7f1d1d;''>Объект обработки не инициализирован</span></div></body></html>'");
	КонецЕсли;

	Попытка
		Возврат ОбъектОбработки.ПолучитьHTMLЧатаСИндикатором(СсылкаСессии, ИмяАгента, ТекстПользователя);
	Исключение
		Возврат ОбъектОбработки.СформироватьHTMLОшибки(ОписаниеОшибки());
	КонецПопытки;

КонецФункции

&НаСервереБезКонтекста
Функция ОтсортироватьСообщенияПоИдентификатору(История)
	Возврат История;
КонецФункции

&НаСервереБезКонтекста
Функция ЭкранироватьHTML(Знач Текст)
	Возврат Текст;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторАгента(СсылкаАгента)
	
	Если Не ЗначениеЗаполнено(СсылкаАгента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Используем менеджер для получения идентификатора через запрос
	Возврат Справочники.onyx_Агенты.ПолучитьИдентификатор(СсылкаАгента);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторСессии(СсылкаСессии)
	
	Если Не ЗначениеЗаполнено(СсылкаСессии) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Используем менеджер для получения идентификатора через запрос
	Возврат Справочники.onyx_СессииЧата.ПолучитьИдентификатор(СсылкаСессии);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекстОтветаOnyx(ОтветOnyx)
	
	// ОтветOnyx теперь содержит: user_message_id, reserved_assistant_message_id, answer
	Если ТипЗнч(ОтветOnyx) = Тип("Структура") Тогда
		
		// Новый формат с полем answer
		Если ОтветOnyx.Свойство("answer") И ЗначениеЗаполнено(ОтветOnyx.answer) Тогда
			Возврат Строка(ОтветOnyx.answer);
		КонецЕсли;
		
		// Старый формат (для обратной совместимости)
		Если ОтветOnyx.Свойство("messages") И ТипЗнч(ОтветOnyx.messages) = Тип("Массив") И ОтветOnyx.messages.Количество() > 0 Тогда
			ПервоеСообщение = ОтветOnyx.messages[0];
			Если ТипЗнч(ПервоеСообщение) = Тип("Структура") И ПервоеСообщение.Свойство("message") Тогда
				Возврат Строка(ПервоеСообщение.message);
			КонецЕсли;
		КонецЕсли;
		
		Если ОтветOnyx.Свойство("message") Тогда
			Возврат Строка(ОтветOnyx.message);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ОтветOnyx) = Тип("Массив") И ОтветOnyx.Количество() > 0 Тогда
		Возврат Строка(ОтветOnyx[0]);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтветOnyx) Тогда
		Возврат Строка(ОтветOnyx);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиФоновоеЗадание(Идентификатор)

	УстановитьПривилегированныйРежим(Истина);
    
    Результат = Новый Структура("Выполняется, Успех, Ошибка", Ложь, Ложь, Неопределено);
    Если Идентификатор = Неопределено Тогда
        Возврат Результат;
    КонецЕсли;
        
    Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
    Если Задание = Неопределено Тогда
        Возврат Результат;
    КонецЕсли;
    
    Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
        Результат.Выполняется = Истина;
    Иначе
        Результат.Выполняется = Ложь;
        Если Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
            Результат.Успех = Истина;
        Иначе
            Результат.Успех = Ложь;
            Результат.Ошибка = Задание.ИнформацияОбОшибке;
        КонецЕсли;
    КонецЕсли;
    
    Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОбновитьИсториюЧата()
	
	Если Не ЗначениеЗаполнено(Сессия) Тогда
		ЭтаФорма.Сообщения = "";
		Возврат;
	КонецЕсли;
	
	HTMLИстории = ПолучитьHTMLИсторииЧатаНаСервере(Сессия);
	ЭтаФорма.Сообщения = HTMLИстории;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАгента(Команда)
	
	ПараметрыФормы = ПолучитьПараметрыФормыВыбораАгентаНаСервере();
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораАгента", ЭтаФорма);
	ОткрытьФорму("Catalog.onyx_Агенты.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
 КонецПроцедуры
 
&НаКлиенте
Процедура ПослеВыбораАгента(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Агент = ВыбранноеЗначение;
	КонецЕсли;
	
	УстановитьЗаголовокВыбораАгента();
	ОбновитьЧатыНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименованиеСессии(СсылкаСессии)
	
	Если Не ЗначениеЗаполнено(СсылкаСессии) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьНаименованиеСессииНаСервере(СсылкаСессии);
	УстановитьЗаголовокВыбораАгента();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаименованиеСессииНаСервере(Знач СсылкаСессии)
	
	Если Не ЗначениеЗаполнено(СсылкаСессии) Тогда
		Возврат;
	КонецЕсли;
	
	onyx_РаботаССессиямиЧата.ОбновитьМетаданныеСессии(СсылкаСессии);
	
КонецПроцедуры

&НаСервере
Функция УстановитьНаименованиеИДатуДляНовойСессии(Знач СсылкаСессии, Знач СсылкаАгента, Знач Сообщение)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Если Не ЗначениеЗаполнено(СсылкаСессии) Тогда
		Возврат ТекущаяДата;
	КонецЕсли;
	
	Наименование = "";
	
	Если ТипЗнч(Сообщение) = Тип("Строка") И Не ПустаяСтрока(Сообщение) Тогда
		Наименование = onyx_РаботаССессиямиЧата.ПодготовитьТекстНаименования(Сообщение);
	КонецЕсли;
	
	Если ПустаяСтрока(Наименование) И ЗначениеЗаполнено(СсылкаАгента) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Агенты.Наименование КАК Наименование
			|ИЗ
			|	Справочник.onyx_Агенты КАК Агенты
			|ГДЕ
			|	Агенты.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", СсылкаАгента);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ИмяАгента = Строка(Выборка.Наименование);
			Наименование = onyx_РаботаССессиямиЧата.ПодготовитьТекстНаименования(ИмяАгента);
		Иначе
			Наименование = "";
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = НСтр("ru='Новый чат'");
	КонецЕсли;
	
	Попытка
		ОбъектСессии = СсылкаСессии.ПолучитьОбъект();
		ОбъектСессии.Наименование = Наименование;
		ОбъектСессии.ДатаПоследнегоСообщения = ТекущаяДата;
		ОбъектСессии.Записать();
	Исключение
		// Игнорируем ошибки установки наименования и даты
		Возврат ТекущаяДата;
	КонецПопытки;
	
	Возврат ТекущаяДата;
	
КонецФункции

&НаСервере
Процедура УстановитьНаименованиеСессииНаСервере(Знач СсылкаСессии, Знач Наименование)
	
	Если Не ЗначениеЗаполнено(СсылкаСессии) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ОбъектСессии = СсылкаСессии.ПолучитьОбъект();
		Если ПустаяСтрока(Наименование) Тогда
			Наименование = НСтр("ru='Новый чат'");
		КонецЕсли;
		ОбъектСессии.Наименование = Наименование;
		ОбъектСессии.Записать();
	Исключение
		// Игнорируем ошибки установки наименования
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуПоследнегоСообщенияНаСервере(Знач СсылкаСессии, Знач ДатаПоследнегоСообщения)
	
	Если Не ЗначениеЗаполнено(СсылкаСессии) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаПоследнегоСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ОбъектСессии = СсылкаСессии.ПолучитьОбъект();
		ОбъектСессии.ДатаПоследнегоСообщения = ДатаПоследнегоСообщения;
		ОбъектСессии.Записать();
	Исключение
		// Игнорируем ошибки установки даты
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущуюДатуСервера()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура УстановитьЗаголовокВыбораАгента()
 
 	Если ЗначениеЗаполнено(Агент) Тогда
 		Заголовок = Строка(Агент);
 	Иначе
 		Заголовок = НСтр("ru='Выбрать агента'");
 	КонецЕсли;
 
 	Элементы.ВыбратьАгента.Заголовок = Заголовок;
 
 КонецПроцедуры

&НаКлиенте
Процедура НовыйЧат(Команда)
	
	МестныйАгент = ЭтаФорма.Агент;
	
	Если Не ЗначениеЗаполнено(МестныйАгент) Тогда
		СообщитьПользователю(НСтр("ru='Выберите агента перед созданием нового чата.'"));
		Возврат;
	КонецЕсли;
	
	НазваниеНовогоЧата = НСтр("ru='Новый чат'");
	Результат = СоздатьСессиюНаСервере(МестныйАгент, НазваниеНовогоЧата);
	
	Если Результат.Успех Тогда
		Сессия = Результат.Сессия;
		УстановитьНаименованиеСессииНаСервере(Сессия, НазваниеНовогоЧата);
		СинхронизироватьСессиюСТаблицей(Сессия);
		ОбновитьЧатыНаФорме();
		ОбновитьИсториюЧата();
		УстановитьЗаголовокВыбораАгента();
	Иначе
		СообщитьПользователю(Результат.Сообщение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции

#КонецОбласти
